Autodesk.Revit.DB.Sketch.SketchPlane
Returns the Sketch Plane of the Sketch.
Remarks: This property is used to retrieve the Sketch Plane of Sketch.

Autodesk.Revit.DB.Sketch.Profile
Returns the Profile of the Sketch.
Remarks: This property is used to retrieve the Profile of Sketch.

Autodesk.Revit.DB.Sketch
Provides access to the Sketch in Autodesk Revit.